{
  "Q":  [
    "a Chase Bank",
    "a school called Pace",
    "a Citi Bank"
  ],
  "GT":  [
    "Chase Bank, 231 Grand St, New York, NY 10013",
    "Pace High School, 100 Hester St, New York, NY 10002",
    "Citi, 164 Canal St, New York, NY 10013"
  ],
  "GT_optimal":  [
    "Citi, 164 Canal St, New York, NY 10013",
    "Chase Bank, 231 Grand St, New York, NY 10013",
    "Pace High School, 100 Hester St, New York, NY 10002"
  ],
  "walk_nav_template": "go to your left and walk until the intersection with Forsyth st, then turn [?] onto Forsyth St, walk forward on Forsyth St, and turn [?] onto Hester St. The Pace Highschool would then be on your [?]. To continue to the Citi Bank, you can turn around on Hester St and make a [?] turn back to Forsyth St. Walk forward on Forsyth St until intersection with Grand St, then turn [?] onto Grand St. Keep going forward on Grand St until the intersection with Mott St, turn [?] onto Mott St. Continue forward on Mott St until at the intersection with Canal St, turn [?] onto Canal St. The citi bank will then be on your [?].",
  "walk_nav_choices": [
    "left, right, left, left, right, right, right, left",
    "left, left, right, left, right, left, right, right",
    "right, left, right, right, left, left, right, right",
    "right, right, left, right, right, left, right, left"
  ],
  "walk_nav_ans": 2,
  "drive_nav_template": "Drive to your [?] on Grand St until intersection with Eldridge St, then turn [?] onto Eldridge St. Drive forward on Eldridge St until intersection with Hester St, turn [?] onto Hester St, then the Pace High School will be on your [?]. To continue to the Citi Bank, drive forward on Hester St and turn [?] onto Forsyth St. Drive forward on Forsyth St until intersection with Grand St, turn [?] onto Grand St. Continue forward on Grand St until at the intersection with Chrystie St, turn [?] onto Chrystie St. Drive forward on Chrystie St until intersection with Hester St, turn [?] onto Hester St. Keep driving forward on Hester St until at the intersection with Mott St, turn [?] onto Mott St. Then drive forward on Mott St until intersection with Canal St, turn [?] onto Canal St. Finally before the intersection with Elizabeth St, the Citi Bank will be on your [?].",
  "drive_nav_choices": [
    "left, right, right, left, right, left, left, right, left, left, right",
    "left, right, left, right, right, right, left, right, right, left, right",
    "right, left, left, right, right, left, right, right, left, right, left",
    "right, right, left, left, right, left, left, right, left, right, right"
  ],
  "drive_nav_ans": 0,
  "optimal_nav_choices": [
    "Pace School, Chase Bank, Citi Bank",
    "Chase Bank, Citi Bank, Pace School",
    "Citi Bank, Chase Bank, Pace School",
    "Pace School, Citi Bank, Chase Bank"
  ],
  "optimal_nav_ans": 2
}

